#+TITLE: Support CNF-Testbed Audit Logging
#+AUTHOR: Devan Carpenter
#+EMAIL: devan@ii.coop
#+CREATOR: ii.coop
#+DATE: 30th of April, 2019

** CNF Testbed Development Environment

#+BEGIN_SRC tmate
  cd ~/
  git clone git@github.com:cncf/cnf-testbed.git
  cd ~/cnf-testbed
  git remote add upstream https://github.com/cncf/cnf-testbed.git
  git remote set-url --push upstream no_push
  git remote add ii git@github.com:ii/cnf-testbed.git
#+END_SRC

Build Docker Images

#+BEGIN_SRC tmate
  cd ~/cnf-testbed/tools
  docker build -t ubuntu:packet_api -f packet_api/Dockerfile  packet_api/
  docker build -t cnfdeploytools:latest -f deploy/Dockerfile deploy/
#+END_SRC


Backup then overwrite /etc/resolv.conf with the Packet DNS resolver.
This is so we can resolve the cluster namespace.

#+BEGIN_SRC tmate 
  cp /etc/resolv.conf ~/resolv.conf.backup
  sudo su -
  chattr -i /etc/resolv.conf
  echo "nameserver 147.75.69.23" > /etc/resolv.conf
  echo "nameserver 8.8.8.8" >> /etc/resolv.conf
  chattr +i /etc/resolv.conf
  logout
#+END_SRC

Verify that it worked.

#+BEGIN_SRC shell
  cat /etc/resolv.conf
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
nameserver 147.75.69.23
nameserver 8.8.8.8
#+END_EXAMPLE

Setup the env file: `tools/k8s-cluster.env`

#+BEGIN_SRC sh :tangle ~/cnf-testbed/tools/k8s-cluster.env
  export NAME=apisnoop
  export K8S_DEPLOY_ENV=k8sworker
  export MASTER_NODE_COUNT=1
  export WORKER_NODE_COUNT=1
  export MASTER_NODE_TYPE=t1.small
  export WORKER_NODE_TYPE=m2.xlarge.x86
  #export WORKER_NODE_TYPE=n2.xlarge.x86
  export NODE_OS=ubuntu_18_04
  export FACILITY=sjc1
  export ETCD_VERSION=v3.2.8
  export CNI_VERSION=v0.6.0
  export K8S_RELEASE=v1.13.0
  export PLAYBOOK=k8s_worker_vswitch_mellanox.yml
  #export PLAYBOOK=k8s_worker_vswitch_quad_intel.yml
  export PACKET_AUTH_TOKEN=$(cat ~/cross-cloud/cnf-packet-key)
  export PACKET_PROJECT_ID=7a44b778-41d2-49fa-9c92-99148516c600
#+END_SRC

** Debug

Delete Cluster

#+BEGIN_SRC tmate
  cd ~/cnf-testbed/tools/
  source k8s-cluster.env
  ./destroy_k8s_cluster.sh
#+END_SRC

Delete kubeconfig

#+BEGIN_SRC shell
  rm ~/cnf-testbed/tools/data/kubeconfig
#+END_SRC

Verify Master TLS

#+BEGIN_SRC shell
  echo | openssl s_client -connect master.apisnoop.packet.local:443  2>/dev/null | grep subject=
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
subject=/CN=kubernetes
#+END_EXAMPLE

Manually run vppswitch install

#+BEGIN_SRC tmate 
  ${project_root}/tools/deploy_k8s_vppvswitch.sh $(pwd)/data/kubeconfig
#+END_SRC


